Задача5/src/Documents/Продажа/Продажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Продажа</name>
  <tabularSections>
    <name>Товар</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Задача5/src/Documents/Продажа/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Функция ПересчетСуммы(ТекущаяСтрока)
	Возврат ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
КонецФункции

&НаКлиенте
Процедура ТоварЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товар.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ПересчетСуммы(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товар.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ПересчетСуммы(ТекущаяСтрока);
КонецПроцедуры
